<?php

return [
    'this_campaign_already_with_strategy' => 'Мы не смогли добавить кампанию: ":campaign" к стратегии. К текущей рекламной кампании уже применена стратегия ":strategy"',
    'this_keywords_in_different_groups' => 'Ключевые слова, которые вы хотите изменить, находятся в разных группах',

    'strategy_update_error' => 'Возникла ошибка при обновлении стратегии',
    'strategy_create_error' => 'Возникла ошибка при создании стратегии',
    'strategy_min_orders' => 'Мы не смогли добавить кампанию: ":campaign" к стратегии. У текущей кампании отсутствует накопленная статистика для применения данной стратегии. Рекомендуется применение стратегии “Оптимальное количество показов”',
    'strategy_not_enough_statistic' => 'Стратегия в данный момент не может быть рассчитана, т.к. недостаточно накопленной статистики',
    'strategy_create_success' => 'Рекламная кампания успешно добавлена',
    'strategy_apply_done' => 'Рекламная кампания успешно добавлена. Стратегия рассчитана',
    'strategy_apply_bad' => 'Рекламная кампания успешно добавлена. Но стратегия в данный момент не может быть рассчитана',
    'unique_group_name' => 'Указанное имя группы ":groupName" уже существует в текущей компании',
    'min_budget_value' => 'Значение бюджета должно быть не менее 500 или равно 0',
];
