<?php

return [
    'decrease_count_suppliers' => 'В :word :categories много поставщиков бренда :brand - это негативно сказывается на совокупной выручке. Рекомендуем обратиться в поддержку маркетплейса для проверки и скрытия из продажи других поставщиков. Если вы являетесь правообладателем бренда или его официальным представителем, сократите количество дистрибьютеров на маркетплейс.',
    'subjects_decrease' => 'Данный бренд не присутствует в категориях - :subjects. Рекомендуем вам расширить ассортимент в указанных категориях, чтобы конкурировать с другими брендами.',
    'subject_content' => 'Оптимизируйте карточки и дополните информацию о товаре в следующих категориях: :subjects. Средний объем продаж в этих категориях у бренда :brand ниже, чем у конкурентов.',
];
