<?php

use Illuminate\Database\Migrations\Migration;
use Illuminate\Database\Schema\Blueprint;
use Illuminate\Support\Facades\DB;
use Illuminate\Support\Facades\Schema;

class CreateOzWbCategoriesTable extends Migration
{
    /**
     * Run the migrations.
     *
     * @return void
     */
    public function up()
    {
        Schema::create('oz_wb_categories', function (Blueprint $table) {
            $table->id();
            $table->string('oz');
            $table->string('wb');
        });

        $categories = [
            ['oz' => 'Автотовары', 'wb' => 'Автомобильные товары'],
            ['oz' => 'Автотовары', 'wb' => 'Автоэлектроника'],
            ['oz' => 'Автотовары', 'wb' => 'Запчасти для авто'],
            ['oz' => 'Галантерея и украшения', 'wb' => 'Аксессуары'],
            ['oz' => 'Галантерея и украшения', 'wb' => 'Аксессуары для волос'],
            ['oz' => 'Галантерея и украшения', 'wb' => 'Бижутерия'],
            ['oz' => 'Галантерея и украшения', 'wb' => 'Головные уборы'],
            ['oz' => 'Одежда', 'wb' => 'Аксессуары для малышей'],
            ['oz' => 'Одежда', 'wb' => 'Белье'],
            ['oz' => 'Одежда', 'wb' => 'Белье для малышей'],
            ['oz' => 'Одежда', 'wb' => 'Одежда'],
            ['oz' => 'Одежда', 'wb' => 'Одежда для малышей'],
            ['oz' => 'Одежда', 'wb' => 'Товары для малышей'],
            ['oz' => 'Обувь', 'wb' => 'Аксессуары для обуви'],
            ['oz' => 'Обувь', 'wb' => 'Обувь'],
            ['oz' => 'Алкогольная продукция', 'wb' => 'Алкогольная продукция'],
            ['oz' => 'Бытовая техника', 'wb' => 'Бытовая техника'],
            ['oz' => 'Бытовая техника', 'wb' => 'Крупная бытовая техника'],
            ['oz' => 'Бытовая техника', 'wb' => 'Техника для кухни'],
            ['oz' => 'Дом', 'wb' => 'Все для садоводства'],
            ['oz' => 'Дом', 'wb' => 'Дом'],
            ['oz' => 'Дом', 'wb' => 'Посуда и инвентарь'],
            ['oz' => 'Дом', 'wb' => 'Садовая техника'],
            ['oz' => 'Дом', 'wb' => 'Садовые инструменты'],
            ['oz' => 'Дом', 'wb' => 'Хозяйственные товары'],
            ['oz' => 'Дом', 'wb' => 'Хранение вещей'],
            ['oz' => 'Дом', 'wb' => 'Шторы и аксессуары'],
            ['oz' => 'Продукты питания', 'wb' => 'Детское питание'],
            ['oz' => 'Продукты питания', 'wb' => 'Продукты'],
            ['oz' => 'Мебель', 'wb' => 'Дом'],
            ['oz' => 'Мебель', 'wb' => 'Посуда и инвентарь'],
            ['oz' => 'Мебель', 'wb' => 'Хозяйственные товары'],
            ['oz' => 'Мебель', 'wb' => 'Хранение вещей'],
            ['oz' => 'Мебель', 'wb' => 'Шторы и аксессуары'],
            ['oz' => 'Аптека', 'wb' => 'Здоровье'],
            ['oz' => 'Аптека', 'wb' => 'Фарма'],
            ['oz' => 'Электроника', 'wb' => 'Игровые консоли и игры'],
            ['oz' => 'Электроника', 'wb' => 'Ноутбуки и компьютеры'],
            ['oz' => 'Электроника', 'wb' => 'Оргтехника'],
            ['oz' => 'Электроника', 'wb' => 'Периферия и аксессуары'],
            ['oz' => 'Электроника', 'wb' => 'Сетевое оборудование'],
            ['oz' => 'Электроника', 'wb' => 'Смартфоны и аксессуары'],
            ['oz' => 'Электроника', 'wb' => 'Телевизоры и аудиотехника'],
            ['oz' => 'Электроника', 'wb' => 'Торговое оборудование'],
            ['oz' => 'Электроника', 'wb' => 'Умный дом и безопасность'],
            ['oz' => 'Электроника', 'wb' => 'Фото и Видеотехника'],
            ['oz' => 'Электроника', 'wb' => 'Электроника'],
            ['oz' => 'Электроника', 'wb' => 'Электротранспорт'],
            ['oz' => 'Детские товары', 'wb' => 'Игрушки'],
            ['oz' => 'Канцелярия', 'wb' => 'Канцелярские товары'],
            ['oz' => 'Антикварные издания', 'wb' => 'Книжная продукция и диски'],
            ['oz' => 'Красота и здоровье', 'wb' => 'Красота'],
            ['oz' => 'Ремонт и строительство', 'wb' => 'Сантехника'],
            ['oz' => 'Ремонт и строительство', 'wb' => 'Спецодежда и СИЗы'],
            ['oz' => 'Ремонт и строительство', 'wb' => 'Строительные инструменты'],
            ['oz' => 'Ремонт и строительство', 'wb' => 'Строительные материалы'],
            ['oz' => 'Спорт и отдых', 'wb' => 'Спортивная обувь'],
            ['oz' => 'Спорт и отдых', 'wb' => 'Спортивная одежда'],
            ['oz' => 'Спорт и отдых', 'wb' => 'Спортивное питание и косметика'],
            ['oz' => 'Спорт и отдых', 'wb' => 'Спортивные аксессуары'],
            ['oz' => 'Спорт и отдых', 'wb' => 'Спортивный товар'],
            ['oz' => 'Спорт и отдых', 'wb' => 'Товары для отдыха и кемпинга'],
            ['oz' => '18+', 'wb' => 'Товары для взрослых'],
            ['oz' => 'Зоотовары', 'wb' => 'Товары для животных'],
            ['oz' => 'Электронные сигареты и товары для курения', 'wb' => 'Товары для курения'],
            ['oz' => 'Продукт медиа', 'wb' => 'Цифровой контент'],
            ['oz' => 'Галантерея и украшения', 'wb' => 'Ювелирная бижутерия'],
            ['oz' => 'Галантерея и украшения', 'wb' => 'Ювелирные украшения'],
            ['oz' => 'Хобби и творчество', 'wb' => 'Для праздника'],
            ['oz' => 'Музыкальные инструменты', 'wb' => 'Профессиональные музыкальные инструменты'],
            ['oz' => 'Хобби и творчество', 'wb' => 'Рукоделие'],
            ['oz' => 'Фермерское хозяйство', 'wb' => 'Товары для животных'],
            ['oz' => 'Питомцы', 'wb' => 'Товары для животных'],
            ['oz' => 'Печатные издания', 'wb' => 'Книжная продукция и диски'],
            ['oz' => 'Антиквариат и коллекционирование', 'wb' => 'Дом'],
            ['oz' => 'Личная гигиена', 'wb' => 'Красота'],
            ['oz' => 'Маркетинговое вложение', 'wb' => 'Цифровой контент'],
        ];

        DB::table('oz_wb_categories')->insert($categories);
    }

    /**
     * Reverse the migrations.
     *
     * @return void
     */
    public function down()
    {
        Schema::dropIfExists('oz_wb_categories');
    }
}
